{
  "Calendar": "تقویم",
  "Gregorian": "میلادی",
  "Persian": "هجری شمسی",
  "Arabic": "هجری قمری",
  "Indian": "هندی",
  "Locale": "زبان",
  "English": "انگلیسی",
  "Fa": "فارسی",
  "Ar": "عربی",
  "Hindi": "هندی",
  "Mode": "مود",
  "Single": "تکی",
  "Multiple": "چندتایی",
  "Range": "دامنه",
  "Other Pickers": "انتخابگر های دیگر",
  "Disable": "غیر فعال",
  "Highlight": "هایلایت",
  "Time Picker": "انتخابگر زمان",
  "Only Time Picker": "فقط انتخابگر زمان",
  "Only Month Picker": "فقط گرفتن ماه",
  "Only Year Picker": "فقط گرفتن سال",
  "Dates panel": "پنل تاریخ ها",
  "Enable": "فعال",
  "Type": "حالت",
  "Input": "اینپوت",
  "Input-Icon": "اینپوت-آیکن",
  "Icon": "آیکن",
  "Button": "دکمه",
  "Layout": "نما",
  "Default": "پیش فرض",
  "Prime": "اولیه",
  "Mobile": "موبایل",
  "Other Days": "روز های دیگر",
  "Colors": "رنگ",
  "Green": "سبز",
  "Red": "قرمز",
  "Yellow": "زرد",
  "Purple": "بنفش",
  "Teal": "سبز چرمی",
  "BackGrounds": "رنگ زمینه",
  "Dark": "مشکی",
  "Gray": "خاکستری",
  "Brown": "قهوه ای",
  "Calendar Position": "موقعیت تقویم",
  "Bottom Left": "پایین چپ",
  "Bottom Center": "پایین وسط",
  "Bottom Right": "پایین راست",
  "Top Left": "بالا چپ",
  "Top Center": "بالا وسط",
  "Top Right": "بالا راست",
  "Right Top": "راست بالا",
  "Right Center": "راست وسط",
  "Right Bottom": "راست پایین",
  "Left Top": "چپ بالا",
  "Left Center": "چپ وسط",
  "Left Bottom": "چپ پایین",
  "Animation": "انیمیشن",
  "ON": "روشن",
  "OFF": "خاموش",
  "Left": "چپ",
  "Right": "راست",
  "Top": "بالا",
  "Bottom": "پایین",
  "DatePanel Position": "موقعیت پنل تاریخ ها",
  "Number Of Months": "تعداد ماه ها",
  "demo_descriptions": [
    "پنل تاریخ ها و موقعیت پنل تاریخ ها به صورت پیش فرض غیر فعال هست و زمانی فعال میشه که حالت دیت پیکر رو به چند تایی یا دامنه تغییر بدید و تعداد ماه ها برابر با 1 باشه (البته این تنظیمات فعلی هست که من اعمال کردم ، شما میتونید اونارو تو هر شرایطی فعال کنید).",
    "در حالت چند تایی یا دامنه، 'فقط انتخابگر زمان' غیر فعال میشه.",
    "در این صفحه تعداد ماه ها به حداکثر عدد 3 محدود شده ولی شما میتونید هر عددی رو برای آن در نظر بگیرید.",
    "اولین روز هفته زمانی که مقدار انتخابگر های دیگر برابر با فقط انتخابگر زمان، فقط گرفتن ماه یا فقط گرفتن سال هست غیر فعال میباشد.",
    "تعداد ماه ها زمانی که مقدار انتخابگر های دیگر برابر با فقط انتخابگر زمان، فقط انتخابگر زمان آنالوگ، فقط گرفتن ماه یا فقط گرفتن سال هست غیر فعال میباشد.",
    "موقعیت تقویم و انیمیشن زمانی فعال میشن که حالت رو از تقویم به اینپوت یا هر چیز دیگه ای تغییر بدید."
  ],
  "Home": "خانه",
  "Installation & Usage": "نصب و راه اندازی",
  "Props": "پراپ ها",
  "true if value is Array": "true اگر مقدار value آرایه باشد",
  "Formatting Tokens": "انواع فرمت",
  "Token": "توکن",
  "npm_description": "برای نصب این پکیج توسط npm کد زیر را در ترمینال خود بنویسید .",
  "yarn_description": "اگر از yarn استفاده میکنید میتونید از کد زیر استفاده کنید.",
  "Important Notes": "توضیحات مهم",
  "Basic Import": "ایمپورت کردن پکیج در پروژه",
  "import_datepicker": "دیت پیکر",
  "import_calendar": "تقویم",
  "important_note_description_part_1": "من این کامپوننت رو به نحوی نوشتم که شما بتونید ازش با یا بدون استیت استفاده کنید.",
  "important_note_description_part_2": "در مواقعی که مقدار اولیه ای ندارید یا میخواید تاریخ یا تاریخ های انتخاب شده کاربر رو بدون اعمال تغییرات سابمیت کنید، میتونید این کامپوننت رو بدون استیت اضافه استفاده کنید.",
  "important_note_description_part_3": "نمونه کد دیت پیکر بدون تعریف کردن استیت:",
  "important_note_description_part_4": "اما اگر میخواید تاریخ اولیه ای رو برای دیت پیکر یا تقویم تعریف کنید یا میخواید تغییراتی رو به تاریخ های انتخاب شده کاربر اعمال کنید، باید از یک استیت برای نگهداری تاریخ ها استفاده کنید :",
  "important_note_code_comment_1": "تغییرات روی تاریخ رو اینجا اعمال کنید",
  "important_note_description_part_5": "مقدار اولیه تاریخ میتونه از جنس Date ،DateObject ،Number و یا String باشه ولی به محض انتخاب تاریخ جدید توسط کاربر، Type آن به DateObject تغییر میکنه.",
  "important_note_description_part_6": "بنابراین اگر در هنگام سابمیت فرم خود میخواید تاریخ انتخاب شده ی کاربر رو به Date جاوااسکریپت تبدیل کنید، میتونید خیلی راحت از متد ()toDate استفاده کنید.",
  "important_note_description_part_7": "نکته ای که باید در استفاده از متد toDate بگم اینه که اگر شما مقدار اولیه ای از جنس غیر از دیت آبجکت تعریف کرده باشید و سابمیت فرمتون موقعی انجام شه که کاربر به دلایلی تاریخ جدیدی رو انتخاب نکرده باشه ، پس مقدار اولیه شما هم به دیت آبجکت تبدیل نشده و بهتره که هنگام سابمیت فرم خود یک شرط رو مانند کد زیر برای بررسی این موضوع اضافه کنید:",
  "important_note_description_part_8": "اگر مقداری که به دیتپیکر یا تقویم وارد میکنید از جنس استرینگ است و فرمت آن استرینگ با فرمت پیشفرض (YYYY/MM/DD hh:mm:ss a) متفاوت میباشد، باید فرمت آن استرینگ با فرمتی که به دیت پیکر وارد کرده اید همخوانی داشته باشد . در غیر این صورت آن تاریخ اشتباه پارس میشود.",
  "important_note_description_part_9": "برای مثال اگر ۰۵/۱۸/۲۰۲۰ ۰۲:۲۰:۳۶ را به عنوان مقدار در نظر گرفته ید، باید فرمتی که به دیتپیکر یا تقویم وارد میکنید هم به این صورت باشد : MM/DD/YYYY HH:mm:ss",
  "dateobject": [
    "این پکیج برای تبدیل ، پارس و فرمت زمان از DateObject استفاده میکنه.",
    "استفاده از DateObject به عنوان مقدار اولیه اختیاریه ولی بعد از انتخاب زمان توسط کاربر مقدار اولیه تعریف شده شما به DateObject تبدیل میشه.",
    "برای اطلاعات بیشتر میتونید به <a target='__blanck' href='https://github.com/shahabyazdi/react-date-object/'>صفحه گیت هاب</a> DateObject مراجعه کنید."
  ],
  "TypeScript": "تایپ اسکریپت",
  "typescript": [
    "همانطور که در قسمت قبل گفته شد؛ مقدار اولیه تاریخ میتونه از جنس Date , DateObject , Number و یا String باشه ولی به محض انتخاب تاریخ جدید توسط کاربر ، Type آن به DateObject تغییر میکنه.",
    "پس اگر میخواهید از useState استفاده کنید ؛ بسته به نوع مقدار اولیه؛ باید تایپ مقدار اولیه بعلاوه تایپ های Dateobject  و []Dateobject را نیز به useState اضافه کنید:"
  ],
  "Name": "نام",
  "Availability (DatePicker/ Calendar)": "دسترسی (تقویم / دیت پیکر)",
  "Availability (Parse /Format)": "دسترسی (پارس / فرمت)",
  "both": "هر دو",
  "DatePicker": "دیت پیکر",
  "full year": "شماره چهار رقمی سال",
  "2 digits year": "شماره دو رقمی سال",
  "month name": "نام کامل ماه",
  "month short name": "نام کوتاه ماه",
  "2 digits month number": "شماره دو رقمی ماه",
  "month number": "شماره ماه",
  "2 digits day of year": "شماره دو رقمی روز سال",
  "day of year": "روز سال",
  "2 digits day of month": "شماره دو رقمی روز ماه",
  "day of month": "روز ماه",
  "2 digits week of year": "شماره دو رقمی هفته سال",
  "week of year": "هفته سال",
  "week day name": "اسم روز هفته",
  "week day short name": "نام کوتاه روز هفته",
  "2 digits week day number": "شماره دو رقمی روز هفته",
  "week day number": "شماره روز هفته",
  "2 digits hour (24 hour mode)": "شماره دو رقمی ساعت (24 ساعته)",
  "hour (24 hour mode)": "شماره ساعت (24 ساعته)",
  "2 digits hour (12 hour mode)": "شماره دو رقمی ساعت (12 ساعته)",
  "hour (12 hour mode)": "شماره ساعت (12 ساعته)",
  "2 digits minute": "شماره دو رقمی دقیقه",
  "minute": "دقیقه",
  "2 digits second": "شماره دو رقمی ثانیه",
  "second": "ثانیه",
  "3 digits millisecond": "شماره سه رقمی میلی ثانیه",
  "2 digits millisecond": "شماره دو رقمی میلی ثانیه",
  "1 digit millisecond": "شماره تک رقمی میلی ثانیه",
  "meridiem": "قبل از ظهر یا بعد از ظهر",
  "meridiem lowercase": "ق.ظ یا ب.ظ",
  "Calendars & Locales": "تقویم ها و زبان ها",
  "Calendars": "تقویم ها",
  "Locales": "زبان ها",
  "calendars": [
    "در حال حاضر از تقویم های میلادی ، هجری شمسی ، هجری قمری و هندی در این پکیج پشتبانی میشه.",
    "برای استفاده از هر کدام از این تقویم ها باید پراپرتی calendar رو برابر با یکی از مقادیر زیر قرار بدید:"
  ],
  "calendar_descriptions_v3": [
    "این پکیج به صورت پیشفرض از تقویم میلادی و زبان انگلیسی استفاده میکنه، در نتیجه اگر میخواید از تقویم و زبان پیشفرض استفاده کنید احتیاج به ایمپورت کردن زبان و تقویم خاصی رو ندارید، ولی برای استفاده از تقویم ها و زبان های دیگر باید هرکدام از اونها رو به صورت جداگانه ایمپورت کنید.",
    "تقویم ها و زبان ها داخل پکیج react-date-object نگهداری میشن که همزمان با این پکیج نصب میشه.",
    "در دو جدول زیر به ترتیب تمام تقویم ها و زبان هایی که میشه ازشون استفاده کرد به همراه ادرس آنها آورده شده و در ادامه مثال هایی از نحوه ایمپورت کردن هر کدام از آنها اورده شده است."
  ],
  "jalali_description": "به دلیل استفاده از محاسبات ثابت در تقویم جلالی، تبدیل تاریخ از تقویم های دیگر به جلالی در مقایسه با تقویم هجری شمسی، ممکن است با یک روز تفاوت انجام شود.",
  "import_calendar_descriptions": "تمام تقویم های موجود در DateObject در پوشه calendars قرار دارند، پس برای ایمپورت کردن هر کدام از اونا از این قاعده استفاده کنید:",
  "import_calendar_descriptions_1": "در جدول زیر تمام تقویم ها به همراه مسیر ایمپورت کردنشون اورده شده :",
  "lunar_hijri_description": "تقویم هجری قمری قراردادی. (به دلیل استفاده از محاسبات قراردادی ممکن است 1 و حداکثر 2 روز با تقویم هجری قمری هلالی متفاوت باشد)",
  "locales": [
    "زبان های موجود عبارت اند از : انگلیسی ، فارسی ، عربی و هندی.",
    "همچنین برای استفاده از هر کدام از این زبان ها باید پراپرتی locale رو برابر با یکی از مقادیر زیر قرار بدید:"
  ],
  "locales_v3": [
    "قاعده ایمپورت کردن زبان ها هم مثل تقویم ها میمونه، با این تفاوت که به جای استفاده از پوشه calendars از پوشه locales استفاده میکنید.",
    "یه دلیل اینکه هر کدام از تقویم ها دارای فایل های زبان جداگانه خودشون هستند، نحوه نامگذاری فایل های موجود در پوشه locales به صورت 'نام تقویم_نام زبان' انتخاب شده.",
    "برای مثال اگر میخواید از تقویم میلادی با زبان فارسی استفاده کنید لازمه که فایل gregorian_fa و همینطور اگر میخواید از تقویم شمسی و زبان فارسی استفاده کنید باید فایل persian_fa رو ایمپورت کنید."
  ],
  "Value": "مقدار",
  "gregorian": "میلادی",
  "persian": "هجری شمسی",
  "Solar Hijri": "هجری شمسی",
  "Jalali": "جلالی",
  "arabic": "هجری قمری",
  "Lunar Hijri": "هجری قمری",
  "indian": "هندی",
  "Language": "زبان",
  "english": "انگلیسی",
  "fa": "فارسی",
  "farsi": "فارسی",
  "ar": "عربی",
  "hi": "هندی",
  "hindi": "هندی",
  "Import Path": "مسیر",
  "Descriptions": "توضیحات",
  "Quick Access": "دسترسی سریع",
  "calendar_descriptions": "شما میتونید هر کدام از این پراپرتی ها را که لازم میدونید چه در دیت پیکر و چه در تقویم در کنار هم استفاده کنید. به عنوان نمونه به مثال های زیر توجه کنید :",
  "Default Calendar": "تقویم پیشفرض (تقویم میلادی ، زبان انگلیسی)",
  "Default DatePicker": "دیت پیکر پیشفرض",
  "Persian calendar with Farsi locale": "تقویم هجری شمسی ، زبان فارسی",
  "Persian DatePicker": "دیت پیکر هجری شمسی",
  "persian_datepicker_description": [
    "این پکیج به صورت پیشفرض از تقویم میلادی و زبان انگلیسی استفاده میکنه و direction پیشفرضش هم چپ به راست در نظر گرفته شده. به همین دلیل در صفحاتی که direction آن راست به چپ هست، باید مقدار calendarPosition را برابر با auto-right قرار بدید.",
    "فرمت پیشفرض نمایش تاریخ در input به صورت YYYY/MM/DD تعریف شده. در صورت نیاز و در صفحات راست به چپ، میتونید مقدار format رو به DD/MM/YYYY تفییر بدید."
  ],
  "Arabic calendar with Arabic locale": "تقویم هجری قمری ، زبان عربی",
  "Indian calendar with Indian locale": "تقویم هندی ، زبان هندی",
  "Persian datepicker with English locale": "دیت پیکر با تقویم شمسی و زبان انگلیسی",
  "Component with Children": "اضافه کردن المنت به عنوان Children",
  "Calendar With Children": "تقویم به همراه children",
  "DatePicker With Children": "دیت پیکر به همراه children",
  "DESELECT": "لغو انتخاب",
  "TODAY": "امروز",
  "clicked": "کلیک شد",
  "click me": "کلیک کنید",
  "Multiple Mode": "انتخابگر چندتایی",
  "Sorting Dates": "مرتب سازی تاریخ ها",
  "multiple_mode": [
    "برای فعال شدن انتخاب چند زمان باید پراپرتی multiple رو برابر با true کنید.",
    "فقط یادتون باشه که در حالت multiple و در متد onChange به جای یک date خاص ، آرایه ای از زمان ها رو دریافت میکنید، اگر هم میخواید مقادیری رو از قبل تعریف کنید اونهارو داخل آرایه قرار بدید.",
    "من تو این مثال امروز و فردا رو داخل آرایه قرار میدم تا ببینید چجوری میشه بعد تو پروژه خودتون تغییرش بدید یا حذفش کنید."
  ],
  "multiple_sort_example": "در این مثال ، تاریخ هایی با type های مختلف به عنوان مقدار اولیه در نظر گرفته شده و با استفاده از ویژگی sort مرتب شده اند.",
  "multiple_sort_comment": "زمان یونیکس با احتساب میلی ثانیه (21 آگوست 2020)",
  "DatePanel": "پنل تاریخ ها",
  "date_panel_description": [
    "اگر خواستید حالت multiple یا range رو فعال کنید ، میتونید از پلاگین DatePanel هم استفاده کنید تا لیست تاریخ هارو هم داشته باشید.",
    "برای مشاهده لیست تاریخ ها باید پلاگین DatePanel رو import کنید:"
  ],
  "Multiple Month Picker": "انتخابگر چندتایی ماه ها",
  "Multiple Year Picker": "انتخابگر چندتایی سال ها",
  "Range Month Picker": "انتخابگر دامنه ای از ماه ها",
  "Range Year Picker": "انتخابگر دامنه ای از سال ها",
  "Range Mode": "انتخابگر دامنه ای از زمان",
  "Range Picker": "انتخابگر دامنه ای از زمان",
  "range_mode": [
    "برای استفاده از حالت range هم باید مقدار value تون آرایه باشه . حالا میتونه این آرایه خالی باشه یعنی [] باشه که در این صورت هیچ دامنه ی تاریخی در دیتپیکرتون نشون داده نمیشه تا خود کاربر یکی رو انتخاب کنه، یا میتونید خودتون یک مقدار رو به عنوان مقدار اولیه تعریف کنید. فقط نکته ای که باید در هنگام مشخص کردن مقدار اولیه در نظر بگیریید اینه که در حالت range آرایه شما باید یک یا دو تا تاریخ داشته باشه و اگه از دوتا بیشتر باشه فقط تاریخ اول و آخر موجود در اون آرایه در نظر گرفته میشن.",
    "تعریف کردن مقدار اولیه هم که خیلی سادست ، من اینجا یک ارایه که داخلش دوتا تاریخ هست که اولیش 4 روز قبل و دومیش 4 روز بعد هست رو در آرایه قرار میدم تا ببینید چجوری کار میکنه :"
  ],
  "Displaying Each Days In Range": "نمایش تمام روزهای داخل دامنه",
  "date_panel_range": "همانطور که در مثال موجود در قسمت انتخابگر چندتایی هم اشاره شد ، برای مشاهده لیست تاریخ ها باید پلاگین DatePanel رو import کنید:",
  "each_days_in_range": [
    "همانطور که در مثال بالا مشاهده می کنید، در حالت range، فقط تاریخ های شروع و پایان در DatePanle نمایش داده می شود.",
    "اما اگر می خواهید هر یک از تاریخ های مابین شروع و پایان را در پنل تاریخ ها مشاهده کنید ، می توانید از پراپرتی eachDaysInRange استفاده کنید.",
    "به همین ترتیب ، در onChange نیز فقط تاریخ شروع و پایان داده می شود و اگر می خواهید تاریخ های مابین شروع و پایان را داشته باشید ، می توانید از فانکشن getAllDatesInRange استفاده کنید.",
    "فقط بخاطر داشته باشید که فعال کردن ویژگی eachDaysInRange در دامنه های بزرگی از تاریخ ممکن است باعث کندی رندر ری اکت شود ، بنابراین بهتر است DatePicker خود را با minDate و maxDate محدود کنید.",
    "در مثال زیر ، DatePicker محدود به آغاز و پایان ماه جاری است."
  ],
  "Only Time Picker Meridiem": "فقط انتخابگر زمان با نمایش قبل یا بعد از ظهر",
  "Only Month Picker With Different Format": "فقط گرفتن ماه با فرمتی دیگر",
  "Multiple Months": "نمایش چند ماه در تقویم",
  "Single Mode": "حالت تکی",
  "multiple_months": [
    "برای تنظیم تعداد ماههایی که می خواهید در تقویم نمایش داده شود ، از پراپرتی numberOfMonths استفاده کنید.",
    "این ویژگی رو میشه برای Datapiker یا تقویم در همه حالت های منفرد ، چندگانه و دامنه اعمال کرد.",
    "استفاده از  disableMonthPicker و disableYearPicker اختیاری است ."
  ],
  "multiple_mode_description": "",
  "Min & Max Date": "محدود کردن دریافت زمان",
  "Events": "Event ها",
  "on_open": [
    "اگر شرط خاصی را برای باز شدن یا بسته شدن تقویم در نظر دارید ، میتوانید از event های onOpen  و onClose استفاده کنید.",
    "اگر در onOpen مقدار false  را برگردانید ، تقویم باز نمیشود . و همچنین اگر در onClose مقدار false  را برگردانید ، تقویم بسته نمیشود . "
  ],
  "on_position_change": [
    "هروقت که  دوباره محاسبات موقعیت تقویم انجام شود، فانکشن onChange در المنت-پاپر اجرا میشود .",
    "به دلیل اینکه onChange در datepicker کار دیگری را انجام میدهد ، در اینجا اسم ان را به onPositionChange تغییر دادم.",
    "فانکشن ای که در onPositionChange وارد میکنید در مواقع scroll ، resize ، باز شدن تقویم ، یا زمانی که refreshPosition را از ref  دیت پیکر اجرا کنید ، اجرا میشود.",
    "در فانکشن opPositionChange یک object به عنوان argument ارسال میشود که در آن موقعیت های محاسبه شده popper (تقویم) و arrow و همچنین المنت های والد دیت پیکر که قابل اسکرول شدن هستند قرار دارد.",
    "در این مثال ابجکت نام برده شده در console لاگ میشود و شما میتوانید با باز کردن کنسول مرورگر خود (Ctrl + Shift + i در مرورگر کروم)، ان را مشاهده کنید ."
  ],
  "min_max": [
    "همانند مقدار اولیه، مقدار حداقل یا حداکثر هم میتونه از جنس Date , DateObject , Number و یا  String  باشه. فقط باید این نکته رو در نظر بگیرید که Date تاریخ میلادی رو تولید میکنه و اگه از دیت پیکر با تقویم شمسی استفاده میکنید، بهتره با دیت آبجکت تاریخ شمسی رو تولید کنید.",
    "برای محدود کردن دریافت زمان هم باید مقدار حداقل رو داخل پراپرتی midDate و مقدار حداکثر رو داخل پراپرتی maxDate قرار بدید."
  ],
  "String": "استرینگ",
  "Only MinDate": "فقط مقدار حداقل زمان",
  "Only MaxDate": "فقط مقدار حداکثر زمان",
  "onChange (single mode)": "onChange (انتخابگر تکی)",
  "on_change": [
    "تفاوت onChange در این پکیج با پکیج های دیگر در اینه که آرگومان آن به جای Date به عنوان DateObject ارسال میشه.",
    "همانطور که در قسمت های قبلی هم گفتم، میتونید دیت آبجکت ارسال شده رو با استفاده از متد ()toDate به Date جاوااسکریپت  تبدیل کنید."
  ],
  "click to select": "کلیک کنید",
  "format": "فرمت",
  "javascript date": "تاریخ جاوااسکریپت",
  "onChange (multiple mode)": "onChange (انتخابگر چند تایی)",
  "Array of Dateobjecs": "آرایه ای از دیت آبجکت ها",
  "selected dates": "تاریخ های انتخاب شده",
  "Should open calendar": "باید تقویم باز شود",
  "Should close calendar": "باید تقویم بسته شود",
  "Custom Digits, Months & WeekDays": "اعداد، نام ماه و روزهای هفته دلخواه",
  "Week Days #1": "مشخص کردن روزهای هفته دلخواه #1",
  "weekday": "روزهای هفته فارسی در تقویم، به صورت پیشفرض شن، یک، دو، سه، چهار، پنج، جم، نمایش داده میشن. ولی اگر تمایل دارید مقادیر دلخواه خودتون رو جایگزین کنید ، میتونید به این روش عمل کنید.",
  "Week Days #2": "مشخص کردن روزهای هفته دلخواه #2",
  "Months #1": "مشخص کردن نام ماه های دلخواه #1",
  "months": "همانند دو مثال بالا میتونید برای نمایش نام ماه ها هم مقادیر دلخواه خودتون رو جایگزین کنید:",
  "Months #2": "مشخص کردن نام ماه های دلخواه #2",
  "months_2": "به جای تایپ نام کوتاه ماه ها ، می توانید آنها را از DateObject استخراج کنید:",
  "Format Months & WeekDays": "فرمت کردن نام ماه ها و روز های هفته دلخواه",
  "Open & Close Calendar By DatePicker Ref": "باز و بسته کردن تقویم با استفاده از ref دیتپیکر",
  "locale": [
    "برای دیدن نامهای سفارشی  خودتان در input دیت پیکر ، مانند مثال زیر عمل کنید. (این روش فقط برای DatePicker قابل استفاده است).",
    "* استایل ، formattingIgnoreList و فرمت اختیاری هستند."
  ],
  "Types & Custom Input": "حالت ها و شخصی سازی اینپوت",
  "Types": "حالت ها",
  "Custom (function)": "دستی (فانکشن)",
  "Custom (component)": "دستی (کامپوننت)",
  "Custom (input)": "دستی (اینپوت)",
  "custom_input": "اگر میخواهید تغییراتی رو که در ورودی دیت پیکر انجام میدید رو به صورت همزمان در تقویم هم مشاهده کنید از گزینه handleValueChange استفاده کنید.",
  "Multiple & Range": "انتخابگر های چند تایی و دامنه",
  "multiple_range": [
    "در نسخه 1.8.1 و در حالت چندتایی و دامنه، به جای stringDate ، آرایه ای از stringDate  ها ارسال میشود.",
    "بنابراین برای بدست آوردن مقدار ورودی در نسخه های >= 1.8.1 ، می توانید مثال های زیر را دنبال کنید."
  ],
  "Custom (multiple mode)": "دستی (انتخابگر چند تایی)",
  "Custom (range mode)": "دستی (انتخابگر دامنه)",
  "Customizing Calendar Days": "شخصی سازی روز ها با mapDays",
  "map_days_description_1": "شما میتونید روز های تقویم رو با استفاده از پراپرتی mapDays شخصی سازی کنید. پراپرتی mapDays از شما یک فانکشن میگیره و ازاش خاصیت های مورد نظر شما رو که میخواید رو اون روز پیاده کنید دریافت میکنه.",
  "map_days_description_2": "به طور کلی روش کار با mapDays به این صورت هست :",
  "map_days_description_3": "آبجکتی که داخل فانکشن به عنوان آرگومنت دریافت میشود محتوی پراپرتی های زیر است :",
  "map_days_description_4": "روزی که در حال رندر شدنه",
  "map_days_description_5": "با توجه به حالت تقویم (تکی ، چندتایی یا دامنه) ، نوع تاریخ انتخاب شده میتونه DateObject یا آرایه ای از DateObject ها باشه.",
  "map_days_description_6": "ماهی که کاربر انتخاب کرده و در عنوان تقویم در حال نمایش است. (می تونه با ماه تاریخی که کاربر انتخاب کرده متفاوت باشه).",
  "map_days_description_7": "مقایسه ای بین اعداد روز، ماه و سال دو دیت آبجکت انجام میده.",
  "map_days_description_8": "همونطور که خودتون میدونید، میتونید مثل کد زیر آبجکت دریافت شده رو destructure کنید و هر پراپرتی ای رو که لازم میدونید ازش انتخاب کنید:",
  "map_days_description_9": "*لطفا توجه داشته باشید که هیچ یک از خصوصیات داخل object نباید تغییر کنه ، چون باعث عملکرد نامناسب تقویم میشه.",
  "map_days_description_10": "به عنوان مثال ، اگر روز تمام تاریخ های در حال رندر شدن رو به امروز تغییر بدیم ، این نتیجه رو در بر داره:",
  "map_days_description_11": "پراپرتی هایی که می تونید برگردونید حاوی تمامی پراپرتی هایی است که یک عنصر span قبول می کنه ، به علاوه دو ویژگی دیگه که من به اونا اضافه کردم ، که عبارتند از:",
  "map_days_description_12": "در پایین چند تا مثال از کار هایی که میشه با mapDays انجام داد رو قرار دادم :",
  "Property": "پراپرتی",
  "DateObject or Array": "DateObject یا Array",
  "Styling Days": "شخصی سازی روز ها",
  "Styling Weekends": "قرمز کردن روز های جمعه",
  "map_days_weekends": [
    "برای راحتی کار، کلاس 'highlight highlight-red' رو در فایل css قرار دادم، بنابراین نیازی به ایمپورت کردنش ندارید.",
    "برای قرمز کردن روز ها میتونید از پلاگین هم استفاده کنید که تو بخش پلاگین ها مثالش رو زدم."
  ],
  "Custom Highlight": "هایلایت کردن روز ها",
  "Disabling Days": "غیر فعال کردن روز ها",
  "weekends are disabled": "آخر هفته ها غیر فعال هستند",
  "Hiding Days": "پنهان کردن روز ها",
  "Adding Tiltle to Days": "اضافه کردن عنوان به روز ها",
  "map_days_title": "در این مثال عنوان های دیروز، امروز و فردا به تقویم اضافه شده:",
  "Yesterday": "دیروز",
  "Today": "امروز",
  "Tomorrow": "فردا",
  "Colors & Backgrounds": "رنگها و پس زمینه ها",
  "Background Dark": "پس زمینه مشکی",
  "Background Gray": "پس زمینه خاکستری",
  "Background Brown": "پس زمینه قهوه ای",
  "calendar_position_description": [
    "باید بگم تنظیم کردن موقعیت تقویم در دیت پیکر خیلی منو اذیت کرد جوری که مجبور شدم براش یک <a href='https://github.com/shahabyazdi/react-element-popper' target='_blank'>کتابخونه</a> جدا بنویسم! ولی هنوزم نمیتونم بگم 100% جواب میده، اگر مشکلی با پوزیشن تقویم داشتید میتونید در <a href='https://github.com/shahabyazdi/react-element-popper/issues' target='_blank'>این قسمت</a> مطرح کنید.",
    "تو ورژن های اولی برای کانتینر دیتپیکر از پوزیشن ریلیتیو استفاده میکردم که خوب راحته و محاسباتی لازم نداره ولی به مرور مشخص شد که پوزیشن ریلیتیو اصلا جوابگو نیست، یعنی ممکنه برای یکسری کارا جوابگو باشه ولی برای لیات های پیچیده تر صد در صد به مشکل میخوره.",
    "اینجوری شد که تو ورژن های بعدی پوزیشن کانتینر رو به همون استاتیک تغییر دادم سعی کردم موقعیت تقویم رو با محاسبات جاوااسکریپت مشخص کنم ولی کاشف به عمل اومد که قضیه اونجوریم که ادم فکر میکنه ساده نیست و با چهارتا جمع و تفریق نمیشه موقعیت رو تنظیم کرد! محاسبات همینجوری پیچیده و پیچیده تر شد تا آخر تصمیم گرفتم کلشو به کتابخونه المنت پاپر منتقل کنم تا بشه ازاش تو پروژه های دیگه هم استفاده کرد.",
    "خلاصه سرتونو درد نیارم الان که دارم این مطلب رو مینویسم کتابخونه المت پاپر که صحبتشو کردم 544 خط داره که برای خودمم باور نکردنیه."
  ],
  "calendar_position": [
    "روش مشخص کردن موقعیت تقویم اینجوری که شما باید دوتا موقعیت اصلی و نسبی رو به صورت 'موقعیت اصلی-موقعیت نسبی' برای دیت پیکرتون تعریف کنید، موقعیت اصلی برای اینه که مشخص کنه تقویم باید کجای اینپوت باشه، که براش میتونید چهار تا مقدار بالا، پایین، چپ و راست رو در نظر بگیرید. موقعیت نسبی هم برای اینه که مشخص کنه تقویم کجای موقعیت اصلی قرار بگیره. که خودش از سه قسمت ابتدا، وسط و انتها تشکیل شده.",
    "در زیر تمام موقعیت هایی که میشه برای دیت پیکر تعریف کنید رو آوردم :"
  ],
  "or": "یا",
  "Important Points": "نکات مهم",
  "important_points": [
    "مهم ترین نکته اینه که این کتابخونه فقط سعی میکنه در موقعیتی که براش مشخص کردید قرار بگیره ! چون ممکنه چینش المنت های در بر گیرنده دیت پیکر جوری باشه که تقویم در اون موقعیت جا نشه، یا کاربر شروع به اسکرول کردن یا ریسایز کردن صفحه کنه که در اون صورت هم باز موقعیت تقویم عوض میشه. البته شما میتونید دیت پیکر رو مجبور کنید تا موقعیت تقویم رو دقیقا همونجا که شما میخواید نشون بده، که در این صورت باید از پراپرتی های fixMainPosition و fixRelativePosition استفاده کنید.",
    "برای ایجاد فاصله بین تقویم و اینپوت از مارجین و پدینگ استفاده نکنید و به جاش از پراپرتی های offsetY و offsetX که در دیت پیکر قرار داده شده استفاده کنید.",
    "همونطور که در قسمت توضیحات گفتم پوزیشن ریلیتیو جوابگو نیست پس سعی نکنید پوزیشن کانتینر رو با سی اس اس به ریلیتیو تغییر بدید چون باعث اخلال تو محاسبات موقعیت میشه.",
    "برای فیکس کردن موقعیت اصلی مقدار fixMainPosition رو برابر true و برای فیکس کردن موقعیت نسبی مقدار fixRelativePosition رو برابر true قرار بدید.",
    "موقعیت پیشفرض تقویم برای چینش چپ به راست بهینه شده و مقدار آن برابر bottom-left هست، پس برای دایرکشن های راست به چپ که در زبان های فارسی و عربی کاربرد داره لازمه از موقعیت bottom-right استفاده کنید.",
    "اگر میخواید اندازه اینپوت رو تغییر بدید مقدار box-sizing اینپوت رو border-box بزارید.",
    "اگر دیت پیکر داخل کانتینر با پوزیشن فلکس و فلکس داریکشن column باشه (مثل نمونه پایین)، بهتره برای کانتینر دیتپیکرتون طول تعریف کنید.",
    "مقدار offsetY زمانی اعمال میشه که پوزیشن اصلی، بالا یا پایین باشه و مقدار offsetX هم، زمانی اعمال میشه که پوزیشن اصلی، چپ یا راست باشه."
  ],
  "Example": "مثال",
  "Main Position": "موقعیت اصلی",
  "Relative Position": "موقعیت نسبی",
  "Fix Main Position": "فیکس شدن موقعیت اصلی",
  "Fix Relative Position": "فیکس شدن موقعیت نسبی",
  "Offset Y": "فاصله عمودی",
  "Offset X": "فاصله افقی",
  "top": "بالا",
  "bottom": "پایین",
  "left": "چپ",
  "right": "راست",
  "start": "شروع",
  "center": "وسط",
  "end": "پایان",
  "Appearance": "شکل ظاهری",
  "ClassNames & Styles": "استایل و کلاس ها",
  "Adding ClassName To Refrence Element (input)": "اضافه کردن کلاس به اینپوت",
  "input_class": [
    "کلاس پیشفرض در حالت <b>اینپوت</b> : <b>rmdp-input</b>",
    " کلاس پیشفرض در حالت <b>دکمه</b> : <b>rmdp-button</b>"
  ],
  "input_class_note": "توجه داشته باشید که هنگام وارد کردن className جدید ، className پیش فرض به طور خودکار حذف می شود.",
  "Adding Style To Refrence Element (input)": "اضافه کردن استایل به اینپوت",
  "Adding ClassName To Popper Element (calendar)": "اضافه کردن استایل به تقویم",
  "calendar_class": [
    "به یاد داشته باشید که هر مقداری را که به عنوان className وارد می کنید ، همزمان به عنوان کلاس arrow هم اعمال می شود.",
    "از آنجا که کلاس تقویم rmdp-wrapper. است ، از سلکتور .rmdp-wrapper.YOUR_CLASSNAME در پرونده css استفاده کنید تا کلاسی که برای تقویم اعمال می کنید با arrow تداخل نداشته باشد."
  ],
  "rmdp_meaning": "rmdp مخفف react multi date picker هست.",
  "ep_meaning": "ep مخفف element popper هست.",
  "container_style": "از اونجا که مقدار display برای کانتینر datepicker برابر با inline-block در نظر گرفته شده، در صورتی که بخواید طول اینپوت رو تغییر بدید، باید طول کانتینر دیت پیکر رو هم تغییر بدید.",
  "Adding Style To Arrow": "اضافه کردن استایل به arrow",
  "Adding ClassName To Arrow": "اضافه کردن کلاس به arrow",
  "Adding Style To DatePicker Container": "اضافه کردن استایل به کانتینر دیتپیکر",
  "Adding ClassName To DatePicker Container": "اضافه کردن کلاس به کانتینر دیتپیکر",
  "Custom Arrow": "شخصی سازی فلش",
  "arrow_description": "پراپرتی arrow در این دیت پیکر به گونه ای در نظر گرفته شده که بشه مقدارش رو Boolean یا ReactElement  وارد کرد.",
  "Disable Arrow": "غیر فعال سازی فلش",
  "disable_arrow": "برای غیرفعال سازی پیکان مقدار arrow  را برابر با false قرار دهید.",
  "custom_arrow": "شما میتوانید به جای استفاده از پیکان پیشفرض ، پیکان شخصی خود را در دیت پیکر رندر کنید.",
  "DatePicker & Calendar Ref": "Ref تقویم و دیت پیکر",
  "date_picker_ref": [
    "دو فانکشن openCalendar  و closeCalendar  به وسیله datepicker، و یک  فانکشن refreshPosition هم  به وسیله  elementpopper  به ref  اضافه میشوند .",
    "همچنین پراپرتی isOpen هم از طرف datepicker به ref  اضافه میشود .",
    "اگر بخواهید تقویم را به صورت دستی را باز و بسته کنید ، میتوانید مانند این مثال  از  فانکشن  های openCalendar  و closeCalendar استفاده کنید."
  ],
  "refresh_position": [
    "در مواقعی که ممکن است تقویم باز باشد و موقعیت input تغییر کند، به دلیل اینکه element popper به click  گوش نمیدهد، موقعیت تقویم ثابت میماند.",
    "در این مواقع میتوانید فانکشن refreshPosition که در ref دیتپیکر قرار دارد استفاده کنید."
  ],
  "example 1 (without using refresh position)": "مثال یک (بدون استفاده از refreshPosition)",
  "example 2 (with using refresh position)": "مثال دو (با استفاده از refreshPosition)",
  "a demo text to force the datepicker to move forward!": "یک متن نمایشی تا دیتپیکر را مجبور به حرکت کند!",
  "first click here": "اول اینجا را کلیک کنید",
  "then click here": "سپس اینجا را کلیک کنید",
  "refresh and close calendar": "رفرش و بستن تقویم",
  "Another Examples": "مثال های دیگر",
  "another_examples": "دو مثال دیگر که مربوط به موقعیت تقویم میشوند هم وجود دارند که ممکن است بخواهید آنها را مشاهده کنید :",
  "another_examples_1": "Event ها #onPositionChange",
  "another_examples_2": "Ref تقویم و دیت پیکر #رفرش-کردن-موقعیت-تقویم",
  "Refresh Position": "رفرش کردن موقعیت تقویم",
  "Other Examples": "مثال های دیگر",
  "Disabling Scroll Sensitivity": "غیر فعال کردن حساسیت اسکرول",
  "disable_scroll": "استفاده از این پراپ، مقدار fixMainPosition را در هنگام scroll کردن true میکند.",
  "Hide On Scroll": "بسته شدن در هنگام اسکرول",
  "Ignore Formatting": "فرمت نکردن حروف",
  "Disable Virtual Keyboard": "غیر فعال کردن صفحه کلید مجازی",
  "Disable Editing": "غیر فعال کردن ویرایش اینپوت",
  "disable_edit": "این ویژگی فقط بر input در حالت منفرد تأثیر می گذارد.",
  "Placeholder": "متن موقت",
  "Disable Year Picker": "غیر فعال کردن پنل دریافت سال",
  "Disable Month Picker": "غیر فعال کردن پنل دریافت ماه",
  "Disabled Input": "اینپوت غیر فعال شده",
  "Disabled Button": "دکمه غیر فعال شده",
  "forward_ref_description": "طریقه وارد کردن ref به تقویم یا دیت پیکر به صورت زیر میباشد:",
  "open": "باز کردن",
  "close": "بستن",
  "Plugins": "پلاگین ها",
  "Code": "کد",
  "Usage": "استفاده",
  "plugins": [
    "چند ویژگی دیگر وجود داره که من آنها را به صورت پیش فرض در فایل اصلی دیتپیکر قرار نمیدم.",
    "دلیلش هم اینه که ممکنه همه تمایل به استفاده از آنها رو نداشته باشند. بنابراین هیچ دلیلی وجود نداره که با قرار دادنشون در فایل اصلی، حجم کار رو افزایش بدم.",
    "نکته خوب دیگه در مورد پلاگین ها اینه که شما ممکنه بخواهید یک امکان به دیت پیکر خود اضافه کنید که در این کتابخونه وجود نداره ، بنابراین می تونید با استفاده از این ویژگی، پلاگینی که خودتون نوشتید رو به datepicker اضافه کنید.",
    "<b>کد مثال بالا :</b>"
  ],
  "plugins_usage_description": "پراپ plugins آرایه ای از پلاگین ها را می پذیرد که به صورت عمومی دو ویژگی زیر را می توان در هر یک از آنها وارد کرد.",
  "plugins_usage": "این روش کلی برای افزودن یک پلاگین وارد شده به دیت پیکر است:",
  "Prop": "پراپ",
  "Availble Plugins": "پلاگین های موجود",
  "Plugin Name": "نام پلاگین",
  "Path": "موقعیت فایل",
  "Browser Path": "فایل مرورگر",
  "Positions": "موقعیت ها",
  "Date Picker Header": "سربرگ دیت پیکر",
  "Date Panel": "پنل تاریخ ها",
  "Multi Colors": "چند رنگی",
  "Settings": "پلاگین تنظیمات",
  "Weekends": "قرمز کننده آخر هفته",
  "Weekend": "آخر هفته",
  "Toolbar": "نوار ابزار",
  "Sizes": "اندازه ها",
  "Header Right": "سربرگ سمت راست",
  "Header Left": "سربرگ سمت چپ",
  "English Calendar with Indian Header": "تقویم میلادی با سربرگ هندی",
  "Styling Header": "شخصی سازی سربرگ",
  "Sort": "قابلیت مرتب سازی بر اساس",
  "Sort By Date": "مرتب سازی بر اساس تاریخ",
  "Position Right": "قرار دادن پنل تاریخ ها در سمت راست تقویم",
  "Without Remove Button": "بدون دکمه حذف",
  "Date Click Listener": "اضافه کردن کلیک لیستنر",
  "are you sure you want to delete this date ?": "آیا مطمعن به حذف این تاریخ هستید ؟",
  "Default Color": "مشخص کردن رنگ پیشفرض",
  "With DatePanel": "همراه با پنل تاریخ ها",
  "Settings Bottom": "پلاگین تنظیمات در پایین تقویم",
  "Custom Settings": "شخصی سازی پلاگین تنظیمات",
  "Default Weekends": "آخر هفته تعریف شده پیشفرض",
  "Weekends: gregorian": "آخر هفته میلادی",
  "Weekends: persian": "آخر هفته شمسی",
  "Weekends: custom": "آخر هفته با تنظیمات شخصی",
  "DateObject": "دیت آبجکت",
  "date_object": [
    "دیت آبجکت در حقیقت یک کلاس ES6 هست که من برای راحت شدن کار با انواع تقویم ها نوشتم تا برای هر تقویم لازم نباشه یک پکیج جدا را در دیت پیکر ایمپورت کنم.",
    "این پکیج رو میشه به صورت همزمان در بک اند و فرانت اند و همچنین به صورت مستقل در مرورگر استفاده کرد.",
    "دیت آبجکت یکسری آپشن های دیگر رو هم داره که کار با زمان را خیلی راحت تر میکه، و من در این قسمت میخوام در مورد یکسری از آپشن های پر کاربرد تر آن صحبت کنم."
  ],
  "Current Moment": "تولید تاریخ همین لحظه",
  "gregorian_1": "برای تولید یک نمونه از DateObject باید از کد ()new DateObject استفاده کنید. اگر کد بالا رو بدون هیچ کانستراکتوری وارد کنید براتون یک نمونه از DateObject با تقویم میلادی (gregorian) و locale انگلیسی (en) ساخته میشه مثلا برای امروز که به میلادی 2021/01/14 هست اگر من یک ()new DateObject تعریف کنم، یک نمونه از همین تاریخ برای من تولید میشه:",
  "gregorian_2": "حالا میتونید با متد format تاریخ خودتون رو فرمت کنید :",
  "gregorian_3": "همچنین اگر توکن خاصی مد نظرتون هست میتونید داخل متد فرمت اون token رو به صورت پارامتر وارد کنید:",
  "gregorian_4": "و اگر داخل توکن هاتون از مقداری استفاده میکنید که میخواید ignore شه ، اون مقادیر را به صورت آرایه در پارامتر دوم تعریف کنید:",
  "gregorian_5": "همونطور که میدونید شما میتونید مقدار های مورد نظرتون رو از تاریخ تولید شده استخراج کنید:",
  "gregorian_6": "به همین صورت بالا میشه مقدار های نام، نام کوتاه، شماره و ایندکس ماه و روز هفته رو هم استخراج کرد:",
  "gregorian_7": "اگر میخواهید به اول و آخر ماه حرکت کنید از متد های ()toFirstOfMonth و ()toLastOfMonth استفاده کنید.",
  "Persian Calendar (Solar Hijri)": "تولید تاریخ هجری شمسی",
  "persian_1": "اگر میخواید تاریخ امروز رو به صورت شمسی تولید کنید کافیه یک آبجکت با پراپرتی calendar که برابر با persian هست رو داخل کانستراکتور DateObject قرار بدید.",
  "Arabic Calendar (islamic hijri)": "تولید تاریخ هجری قمری",
  "Indian Calendar": "تولید تاریخ هندی",
  "Table of most used properties": "جدول پراپرتی هایی که بیشتر مورد استفاده قرار میگیره",
  "Javascript Date": "تاریخ جاوااسکریپت",
  "New DateObject From String": "تولید تاریخ از روی استرینگ",
  "string_1": "چند راه برای تولید تاریخ از روی استرینگ وجود داره که در اینجا اومده:",
  "string_2": "اول اینکه می تونید استرینگ مورد نظرتون رو مستقیماً در کانستراکتور DateObject وارد کنید که برای این منظور باید به دو مورد زیر توجه داشته باشید:",
  "string_3": "تاریخ تولید شده به این روش به تقویم میلادی و زبان انگلیسی پارس میشه.",
  "string_4": "استرینگ وارد شده باید از این فرمت تبعیت کند در غیر اینصورت اشتباه تولید میشه : <b>year month day hour minute second millisecond meridiem</b> که شما میتونید فاصله ها رو با هر کاراکتر دیگه ای جایگرین کنید:",
  "string_5": "اگر فرمت خاصی به غیر از فرمت گفته شده در مثال قبل مد نظرتون هست باید اون فرمت و استرینگ رو داخل یک آبجکت قرار بدید؛ برای این منظور به روش زیر عمل کنید :",
  "string_6": "اگر استرینگ تاریخ شما باید به تقویمی غیر از میلادی یا زبانی غیر از انگلیسی پارس بشه باید اسم اون تقویم و یا اون زبان رو هم مثل این مثال داخل آبجکتتون قرار بدید:",
  "New DateObject from javascript Date": "تولید یک دیت آبجکت از روی Date جاوا اسکریپت",
  "Persian DateObject from javascript Date": "تولید تاریخ شمسی توسط Date جاوا اسکریپت",
  "New DateObject From Numbers": "تولید تاریخ شمسی توسط مقدار عددی",
  "New DateObject from Unix Timestamp": "تولید تاریخ شمسی توسط زمان یونیکس",
  "unix_1": "خب اگه <a href='https://www.unixtimestamp.com/' target='_blank'>اینجا</a> برید بهتون ثانیه یونیکس همون لحظه رو میده.",
  "unix_2": "زمان یونیکس در این لحظه ای که دارم این مطلب رو مینویسم 1614678083 هست.",
  "unix_3": "فقط توجه کنید که این مقدار به ثانیه هست و ما باید به میلی ثانیه تبدیلش کنیم پس ضرب در 1000 اش میکنیم :",
  "unix_4": "اگر میخواید تاریخ میلادی رو از مقدار یونیکسش بسازید، می تونید اون مقدار رو به این روش هم وارد کنید:",
  "unix_5": "فقط اینم بگم که اگر بخواید مقدار unix هر تاریخی رو بدونید باید از متد ()toUnix استفاده کنید. مثلا برای متغیر بالا اگر از متد toUnix استفاده کنیم دوباره همون عدد خودمون برامون چاپ میشه :",
  "Persian Calendar to Arabic Calendar": "تبدیل تاریخ هجری شمسی به هجری قمری",
  "convert_1": "برای تبدیل هر تاریخ به تاریخ دیگه از متد convert استفاده کنید.",
  "Arabic Calendar to Persian Calendar": "تبدیل تاریخ هجری قمری به هجری شمسی ",
  "Gregorian Calendar to Indian Calendar": "تبدیل تاریخ میلادی به هندی",
  "table_1": "متد setMonth در JavaScript ایندکس ماه را می پذیرد ، اما در DateObject باید شماره ماه را وارد کنید",
  "table_2": "همچنین در دیت آبحکت برای ست کردن مقدار زمان میتوانید به روش های زیر نیز عمل کنید:",
  "Digits": "اعداد",
  "digits": [
    "با استفاده از پراپرتی digits می توانید ارقام دلخواه خود را با شماره های پیش فرض جایگزین کنید.",
    "در این مثال، ارقام پیش فرض با اعداد تایلندی جایگزین شده اند."
  ],
  "Opening Calendar On The Specified Date": "باز شدن تقویم در تاریخ دلخواه",
  "Customizing Navigate Buttons": "سفارشی کردن دکمه های پیمایش",
  "Navigate Buttons": "دکمه های پیمایش",
  "Month": "نمایش ماه",
  "Year": "نمایش سال",
  "Week Days": "نمایش روز های هفته",
  "Shadow": "سایه",
  "Arrow": "فلش (پیکان)",
  "Show": "نمایش",
  "Hide": "عدم نمایش",
  "Months": "ماه ها",
  "January, February, ...": "فروردین، اردیبهشت، ...",
  "Jan, Feb, ...": "فر، ار، ...",
  "Days Of Week": "روز های هفته",
  "SUN, MON, ...": "شن، یک، ...",
  "SU, MO, ...": "شن، یک، ...",
  "S, M, ...": "ش، ی، ...",
  "Disabling Navigate Buttons": "غیر فعال کردن دکمه های پیمایش",
  "disable_buttons": "برای غیرفعال کردن دکمه های پیمایش، می توانید مقدار پراپرتی buttons را روی false تنظیم کنید.",
  "custom_buttons": [
    "میتوانید به جای دکمه های پیشفرض، المنت مورد نظر خود را رندر کنید.",
    "برای این منظور میتوانید به یکی از روش های زیر عمل کنید."
  ],
  "code": "کد",
  "style.css": "فایل سی اس اس",
  "disabled_buttons": "اگر برای محدود کردن تقویم یا دیتپیکر، تاریخ حداکثر یا حداقل تعیین کرده باشید، می توانید مقدار disabled را از پراپ ها دریافت کنید.",
  "Manually Set Year And Month In Calendar": "تنظیم دستی ماه و سال در تقویم",
  "year_month_ref": [
    "روشی برای تغییر دستی ماه و سال در تقویم وجود دارد که در مثال زیر آورده شده است.",
    "فقط توجه داشته باشید که این ویژگی فقط در تقویم کار می کند.",
    "برای تنظیم دستی ماه و سال در دیتپیکر، روی <a href='fa/other-examples/#%D8%A8%D8%A7%D8%B2-%D8%B4%D8%AF%D9%86-%D8%AA%D9%82%D9%88%DB%8C%D9%85-%D8%AF%D8%B1-%D8%AA%D8%A7%D8%B1%DB%8C%D8%AE-%D8%AF%D9%84%D8%AE%D9%88%D8%A7%D9%87' target='_blank'>این لینک</a> کلیک کنید."
  ],
  "Manually Set Year And Month In DatePicker": "تنظیم دستی ماه و سال در دیت پیکر",
  "Changing Start Day Of The Week": "تغییر دادن روز شروع هفته",
  "start_day": [
    "برای تغییر دادن روز شروع هفته میتوانید از پراپرتی weekStartDayIndex استفاده کنید.",
    "برای نمونه اگر میخواهید روز شروع هفته یکشنبه باشد، میبایست مقدار weekStartDayIndex را برابر با ۱ قرار دهید.",
    "مقدار weekStartDayIndex حتما باید عددی بین ۰ تا ۶ باشد."
  ],
  "First Day Of Week": "اولین روز هفته",
  "Adding Ref to Calendar & DatePicker": "اضافه کردن ref به تقویم و دیت پیکر",
  "Default Toolbar": "نوار ابزار پیشفرض",
  "Custom Names": "شخصی سازی نام ها",
  "Custom Header Name": "تغییر نام سرتیتر",
  "Sorting The Buttons": "مرتب سازی دکمه ها",
  "on_props_change": [
    "این قابلیت برای پلاگین ها مناسب میباشد.",
    "زیرا برای بعضی از آنها تنظیم پراپرتی های دیتپیکر (کامپوننت والد) از پلاگین (کامپونند فرزند) اجتناب ناپذیر است."
  ],
  "on_month_change": [
    "در این مثال مقدار دهی به پراپرتی currentDate اختیاری است .",
    "پراپرتی currentDate به این منظور مقدار دهی شده است تا تقویم در همان ماه انتخاب شده قبلی باز شود."
  ],
  "on_year_change": [
    "مانند onMonthChange ، تاریخی با نوع DateObject به عنوان آرگومان در فانکشن onYearChange ارسال می شود.",
    "برای مثال اگر می خواهید حالتی از دیت پیکر را پیاده سازی کنید که در آن ماه و سال تاریخ انتخاب شده کاربر با تغییر ماه و سال، تغییر کند ، می توانید از پراپ های onYearChange و onMonthChange استفاده کنید."
  ],
  "Sorting Buttons": "تغییر چینش دکمه ها",
  "Default Range Picker Footer": "فوتر انتخابگر دامنه",
  "Range Picker Footer": "فوتر انتخابگر دامنه",
  "range_picker_footer": "این پلاگین به صورت اختصاصی برای انتخابگر دامنه توسعه داده شده و در حالت های دیگر درست کار نمیکند.",
  "time_picker": [
    "اگر از نسخه های قبلی به نسخه ۲.۶.۰ بروزرسانی کرده باشید،  در هنگام استفاده از انتخابگر زمان داخلی حتما متوجه اخطار نمایش داده شده در کنسول شده اید.",
    "TimePicker داخلی از نسخه 3.0.0 به بالا حذف می شود، به دلیل اینکه تام پیکر مورد استفاده همه نیست و با حذف آن حدود ۲۰ درصد از حجم فایل اصلی کمتر میشود.",
    "همچنین با تغییراتی که در این پلاگین اعمال کردم، حالا میتوان در حالت چند تایی و دامنه نیز از تایم پیکر استفاده کنید، در صورتی که تایم پیکر اصلی این قابلیت را نداشت. ",
    "چند مثال از نحوه استفاده از تایم پیکر در <a href='/fa/other-pickers'>این قسمت</a> آورده شده، پس من به جای نوشتن دوباره آن ها در اینجا،  دو مثال از اضافه کردن تایم پیکر در حالت های چند تایی و دامنه را اضافه میکنم."
  ],
  "Using TimePicker in Multiple Mode": "استفاده از انتخابگر زمان در حالت چندگانه",
  "Using TimePicker in Range Mode": "استفاده از انتخابگر زمان در حالت دامنه",
  "multiple_time_picker": [
    "برای استفاده از تایم پیکر در حالت چند تایی و دامنه، بهتر است از پنل تاریخ ها استفاده شود. به دیلیل اینکه کلیک کردن روی هر تاریخ در پنل تاریخ ها باعت فوکوس شدن آن تاریخ در دیت پیکر میشود و با سوییج کردن روی هر تاریخ، میتوان به صورت متوالی، زمان آن تاریخ انتخاب شده  را تغییر داد.",
    "برای مشخص شدن اینکه کدام تاریخ فوکوس شده است ، می توانید از پراپرتی markFocused در پنل تاریخ ها استفاده کنید."
  ],
  "focused": [
    "با کلیک روی هر تاریخ در پنل تاریخ ها، آن تاریخ فوکوس میشود.",
    "برای بهتر مشخص شدن اینکه کدام تاریخ فوکوس شده است ، میتوانید از پراپرتی markFocused استفاده کنید. همچنین برای شخصی سازی بیشتر آن تاریخ میتوانید برای آن، کلاس ست کنید."
  ],
  "date_panel_note": "نکته مهم در مورد پراپرتی onClickDate که باید گفته بشه اینه که اگر روی تاریخی کلیک شود، مقدار آن تاریخ به عنوان آرگومان در onClickDate ارسال میشود، ولی اگر روی دکمه حذف کلیک شود، باز هم onClickDate صدا زده میشود اما با مقدار آرگومان undefined .",
  "Customizing Focused Date": "شخصی سازی تاریخ متمرکز شده",
  "focus_event_1": [
    "ویژگی onFocusedDateChange یک فانکشن را دریافت می کند و آن را با دو آرگومان فراخوانی می کند (آرگومان اول dateFocused و آرگومان دوم dateClicked) ، که می تواند توسط خود تقویم یا هر پلاگین دیگری فراخوانی شود.",
    "تفاوت زمانی که onFocusedDateChange توسط خود تقویم فراخوانی می شود و هنگامی که توسط یکی از افزونه ها فراخوانی می شود این است که در حالت اول، آرگومان دوم (یعنی dateClicked) همیشه وجود دارد و در حالت دوم، آرگومان دوم همیشه تعریف نشده است.",
    "ویژگی onFocusedDateChange در واقع دو چیز را مشخص می کند."
  ],
  "focus_event_2": [
    "کدام تاریخ در حال حاضر فوکوس شده است.",
    "کدام تاریخ در حال حاضر کلیک شده است."
  ],
  "focus_event_3": [
    "ماهیت این دو با یکدیگر متفاوت است و به عنوان دو آرگومان برای تابعی ای که تعیین کرده اید ارسال می شوند.",
    "در مورد این پراپرتی و آرگومان های آن باید چند نکته را بخاطر بسپارید:"
  ],
  "focus_event_4": [
    "هر دو این آرگومانها ممکن است یک نوع داشته باشند (یا DateObject یا تعریف نشده).",
    "ممکن است یکی از آنها DateObject و دیگری تعریف نشده باشد."
  ],
  "focus_event_5": "در اینجا شرایط مختلف را بررسی می کنیم:",
  "focus_event_6": "انتخابگر های تکی و دامنه:",
  "focus_event_7": [
    "هر دو آرگومان یک نوع دارند (DateObject).",
    "این بدان معنی است که تاریخ متمرکز شده، همان تاریخی است که روی آن کلیک شده است."
  ],
  "focus_event_8": "انتخابگر چند تایی:",
  "focus_event_9": "تا زمانی که کاربر در حال انتخاب تاریخ های جدید باشد، هر دو آرگومان از یک نوع میباشند (DateObject).",
  "focus_event_10": "این بدان معنی است که تاریخ متمرکز شده، همان تاریخی است که روی آن کلیک شده است.",
  "focus_event_11": "اما به محض اینکه کاربر روی تاریخی که قبلاً انتخاب کرده است کلیک کند، تاریخ انتخاب شده حذف می شود و یکی از موارد زیر ممکن است رخ دهد:",
  "focus_event_12": [
    "تاریخی که حذف می شود همان تاریخ فوکوس شده است، در این صورت اولین آرگومان (یعنی dateFocused) تعریف نشده و آرگومان دوم (یعنی dateClicked) تاریخ کلیک شده است.",
    "تاریخ حذف شده با تاریخ فوکوس شده یکسان نیست، در این حالت آرگومان اول تاریخ فوکوس شده ی قبلی، و آرگومان دوم تاریخ حذف شده ی فعلی میباشد."
  ],
  "focus_event_13": "پنل تاریخ ها:",
  "focus_event_14": [
    "به عنوان افزونه ، آرگومان دوم همیشه تعریف نشده است.",
    "با کلیک بر روی هر تاریخ نمایش داده شده در پنل تاریخ ها، این تاریخ فوکوس می شود، بنابراین اگر روی هر تاریخی از DatePanel کلیک کنید ، اولین آرگومان (یعنی dateFocused) همان تاریخ کلیک شده خواهد بود.",
    "اگر کاربر یک تاریخ غیر متمرکز را از طریق پنل تاریخ ها حذف کند، اولین آرگومان همان تاریخ متمرکز قبلی میشود.",
    "اگر کاربر یک تاریخ متمرکز را از طریق پنل تاریخ ها حذف کند، اولین آرگومان نیز تعریف نشده میشود."
  ],
  "Date focused": "تاریخ متمرکز شده",
  "Date clicked": "تاریخ کلیک شده",
  "See Also": "مثال دیگر",
  "Only Analog Time Picker": "فقط انتخابگر زمان آنالوگ",
  "Analog Time Picker": "انتخابگر زمان آنالوگ",
  "Default Analog Time Picker": "آنالوگ تایم پیکر پیش فرض",
  "Color & Background": "تغییر رنگ و پس زمینه",
  "Position Bottom": "تغییر موقعیت به پایین",
  "default_analog_time_picker": [
    "مانند انتخابگر زمان، انتخابگر زمان آنالوگ را هم میتوان در حالت های تکی، چند تایی و دامنه استفاده کرد.",
    "در اینجا مثالی از نحوه استفاده از این افزونه در کنار انتخابگر تکی آورده شده است."
  ],
  "red_clock": [
    "برای کمتر شدن حجم این پلاگین، هر رنگ را در یک فایل سی اس اس جداگانه قراردادم.",
    "بنابراین برای تغییر رنگ ساعت انالوگ در رنگ های قرمز، سبز، بنفش و ... باید مانند مثال زیر، در کنار فایل رنگ های سی اس اس اصلی، فایل سی اس اس ساعت آنالوگ را هم ایمپورت کنید."
  ],
  "Adding / Subtracting Time From Original Moment": "اضافه / کم کردن زمان از لحظه اصلی",
  "add_subtract": [
    "بسته به افزایش یا کاهش دادن زمان از زمان اصلی، میتوان از متد های add یا subtract استفاده کرد.",
    "به اینصورت که باید دو پارامتر مقدار و کلید را به این متد ها پاس دهید.",
    "تایپ مقدار میتواند عدد یا استرینگ و تایپ کلید باید استرینگ باشند.",
    "تمام کلید هایی که میتوان به عنوان پارامتر دوم پاس داد در جدول زیر آمده است:"
  ],
  "Keys": "کلید ها",
  "add_subtract_1": "برای مثال، برای اضافه کردن ۵ روز به لحظه حال میتوان به این صورت عمل کرد:",
  "add_subtract_2": " کم کردن ۱ ماه از تاریخ بالا:",
  "add_subtract_3": "همچنین میتوان همه این عملیات را به صورت پیوسته نیز انجام داد:",
  "Build Your Own Plugin": "پلاگین خود را بنویسید",
  "plugin_info": "محتوای این بخش هنوز کامل نیست و با گذشت زمان به روز می شود.",
  "plugins_doc": [
    "در اینجا میخوام یک سری توضیحات مختصر در مورد نحوه ساخت یک پلاگین را بنویسم.",
    "نمونه پلاگین هایی که خودم لازم میدونستم در حال حاضر در سایت موجود میباشد، ولی قطعا جوابگوی نیاز اکثریت را نخواهند داد، زیرا احتمال دارد هر کس در شرایط مختلف کاری خود، احتیاج به پلاگینی داشته باشد که من به صورت پیشفرض قرار ندادم. پس لازم است که یک آموزش مختصر در این مورد داده بشه تا شما نیازی به خوندن کد منبع پلاگین های قبلی نداشته باشید.",
    "پلاگین ها در حقیقت همان کامپوننت معمولی ری اکت هستند که در موقعیتی که کاربر مشخص میکند قرار میگیرند با این تفاوت که یکسری پراپرتی هایی به صورت پیشفرض به آنها ارسال میشوند.",
    "شرح این پراپرتی ها در آینده در یک جدول آورده خواهد شد.",
    "در حال حاظر ما میخواهیم یک کامپوننت ساده ری اکت بنویسیم و آن را به عنوان یک پلاگین به تقویم معرفی کنیم:"
  ],
  "Step 1: Write Your First Plugin": "مرحله 1: اولین پلاگین خود را بنویسید",
  "plugins_step_1": "همانطور که ملاحظه می کنید،  پلاگین شما مانند دیگر پلاگین ها در سمت راست تقویم نمایش داده میشود.",
  "Step 2: Detecting The Position Of The Plugin": "مرحله 2: تشخیص موقعیت پلاگین",
  "plugins_step_2": "برای تست بیشتر میتوانید موقعیت پلاگین خود را به پایین تغییر دهید.",
  "step_two": [
    "موقعیت افزونه بسته به فعال بودن یا نبودن انتخابگر روز متفاوت است.",
    "به عنوان مثال ، اگر افزونه هایی با موقعیت های مختلف به تقویم وارد شوند اما کاربر ویژگی disableDayPicker را فعال کند ، موقعیت همه پلاگین ها به پایین تغییر می کند.",
    "در این مثال ما component بالا را اصلاح می کنیم تا موقعیت خود را بنویسد، سپس آن را در دو حالت پیش فرض و disableDayPicker آزمایش کنیم:"
  ],
  "Step 3: Detecting If Another Plugin Is Before Or After The Current Plugin": "مرحله 3: تشخیص اینکه پلاگین دیگری قبل یا بعد از پلاگین فعلی است یا خیر",
  "Default Props": "پراپ های پیشفرض",
  "Default Props Table": "جدول پراپ های پیشفرض",
  "calendar_datepicker_props": [
    "حاوی عناصر HTML تقویم و datepicker است ، هر یک از آنها به طور جداگانه در ref خود ذخیره می شوند.",
    "به عنوان مثال ، باتوجه به اینکه فانکشن closeCalendar در ref دیت پیکر قرار دارد. می توانید در پلاگین خود، از آن برای بستن تقویم استفاده کنید.",
    "فقط توجه داشته باشید که اگر کاربر به جای DatePicker از افزونه شما در Calendar استفاده کند ، مقادیر DatePicker و datePickerProps تعریف نشده می شوند."
  ],
  "calendar_props_datepicker_props": [
    "نکته ای که در مورد این دو ویژگی وجود دارد این است که مقدار datePickerProps همیشه بر مقدار CalendarProps اولویت دارد. زیرا DatePicker برخی از پراپرتی های تقویم را تغییر می دهد.",
    "برای تعیین اینکه آیا شما باید از CalendarProps استفاده کنید یا datePickerProps ، بهتر است مثال زیر را دنبال کنید:"
  ],
  "state_prop": [
    "آبجکتی که حاوی داده های مورد نیاز تقویم است.",
    "خصوصیات این object در جدول زیر نوشته شده است.",
    "توجه داشته باشید که type هیچکدام از این پراپرتی ها نباید تغییر کند."
  ],
  "Hiding Year From Header": "مخفی کردن سال",
  "Hiding Month From Header": "مخفی کردن ماه",
  "Hiding Week Days": "مخفی کردن روز های هفته",
  "Read Only Calendar": "فقط خواندنی کردن تقویم",
  "Read Only DatePicker": "فقط خواندنی کردن دیت پیکر",
  "Disabled Calendar": "غیر فعال کردن تقویم",
  "read_only_calendar": "پراپ  های readOnly و disabled هر دو باعث میشوند که کاربر دیگر نتواند تاریخ جدیدی را انتخاب کند، با این تفاوت  که در حالت readOnly، هدر تقویم همچنان فعال میماند ولی در حالت disabled هدر calendar نیز غیر فعال میشود.",
  "Hiding Seconds": "پنهان کردن ثانیه",
  "time_picker_style": "اگر ترجیح می دهید از انتخابگر زمان در سمت راست یا چپ تقویم استفاده کنید، می توانید از پراپرتی style برای تغییر عرض آن استفاده کنید.",
  "Styling TimePicker": "استایل دادن به انتخابگر زمان",
  "Custom Tooltip": "Tooltip دستی",
  "tooltip": "یک ترفند کوچک برای اضافه کردن tooltip دستی.",
  "Multiple Day-Numbers With Different Calendars & Locales": "چند شماره روز با تقویم یا زبان های مختلف",
  "children": "با استفاده از پراپرتی children ، می توانید 'مقدار' یا 'کامپوننت' مورد نظر را با مقدار پیش فرض (شماره روز) جایگزین کنید.",
  "React Hook Form": "ری اکت هوک فرم",
  "Example Of Using React Hook Form": "مثالی از استفاده از React Hook Form",
  "Submitted Date: ": "تاریخ ارسال شده: ",
  "Full Year View": "نمایش تمام سال در تقویم",
  "Full Year Calendar": "تمام سال در تقویم",
  "time_picker_position_right": "اگر نمی خواید از پنل تاریخ استفاده کنید، می تونید از همون انتخابگر زمان با موقعیت پیش فرض استفاده کنید و از منو کشویی داخلیش برای تغییر تاریخ متمرکز استفاده کنید.",
  "time_picker_format_prop": [
    "اگر تقویم در حالت چند گانه یا دامنه باشه و همچنین موقعیت انتخابگر زمانم راست یا چپ باشه، یک منو کشویی با فرمت پیش فرض (YYYY/MM/DD) به انتخابگر زمان اضافه می شه.",
    "بنابراین اگر خواستید، می تونید فرمت منو رو با این پراپ تغییر بدید."
  ],
  "and": "و",
  "Examples": "مثال ها",
  "import_examples": "در زیر چند مثال از ایمپورت کردن تقویم و زبان های مختلف آورده شده است.",
  "calendars_v2": "اگر از نسخه های قبل از 3.0.0 استفاده میکنید، برای مشاهده نحوه وارد کردن تقویم و زبان روی لینک زیر کلیک کنید."
}
